Revit 2027 API
BuiltInFailures.BeamSystemFailures.BeamSystemEdgeBeamTooWide Property
 Beam of user-defined type does not fit into beam system with clear spacing layout rule. Beam type is reset to default.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BeamSystemEdgeBeamTooWide { get; }
Public Shared ReadOnly Property BeamSystemEdgeBeamTooWide As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BeamSystemEdgeBeamTooWide {
	FailureDefinitionId^ get ();
}
static member BeamSystemEdgeBeamTooWide : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.BeamSystemFailures Class
Autodesk.Revit.DB Namespace